[Building.A_conflux_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在此城镇建造新建筑的选项。\n每天提供500 %ICON_GOLD黄金。"

[Building.A_conflux_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供500 %ICON_GOLD黄金。"

[Building.A_conflux_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供1000 %ICON_GOLD黄金。"

[Building.A_conflux_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供2000 %ICON_GOLD黄金。你只能拥有一个国会。"

[Building.A_conflux_Fortification1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位直至驻军上限"

[Building.A_conflux_Fortification2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[Building.A_conflux_Fortification3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[Building.A_conflux_LightningPyramid H7TownTower]
mName="闪电信标"
mDesc="在攻城战中为城镇提供2座箭塔。\n为防御军队中的单位增加+10 %ICON_ATTACK攻击和+15 %ICON_DEFENSE防御。"

[Building.A_conflux_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在此城镇提供7个随机的1阶法术。\n它们会授予所有满足条件的访问英雄。"

[Building.A_conflux_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在此城镇提供6个随机的2阶法术。\n它们会授予所有满足条件的访问英雄。"

[Building.A_conflux_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在此城镇提供4个随机的3阶法术。\n它们会授予所有满足条件的访问英雄。"

[Building.A_conflux_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在此城镇提供2个随机的4阶法术。\n它们会授予所有满足条件的访问英雄。"

[Building.A_conflux_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="允许招募英雄，包括新英雄和战败的英雄。新英雄的选择在每周开始时更换。"

[Building.A_conflux_StoneParapet H7TownDwelling]
mName="小仙子村庄"
mDesc="核心生物住所。\n允许招募小仙子，每周增长率为18。"

[Building.A_conflux_SilverParapet H7TownDwelling]
mName="风仙子村庄"
mDesc="核心生物住所升级。\n允许招募并将小仙子升级为风仙子。\n(基础增长：18/周)"

[Building.A_conflux_LavaPool H7TownGrowthEnhancer]
mName="萌芽"
mDesc="核心生物住所升级。\n每周+9小仙子灵或风仙子。"

[Building.A_conflux_FireCave H7TownDwelling]
mName="源力圣坛"
mDesc="核心生物住所。\n允许招募源力信徒，每周增长率为14。"

[Building.A_conflux_FirePit H7TownDwelling]
mName="源力之源"
mDesc="核心生物住所升级。\n允许招募并将源力信徒升级为源力元素。\n(基础增长：14/周)"

[Building.A_conflux_t2Foundry H7TownGrowthEnhancer]
mName="棱晶圣殿"
mDesc="核心生物住所升级。\n每周+7源力信徒或源力元素。"

[Building.A_conflux_GolemForge H7TownDwelling]
mName="元素之塔"
mDesc="核心生物住所。\n允许招募元素教徒，每周增长率为8。"

[Building.A_conflux_GolemFoundry H7TownDwelling]
mName="元素之城"
mDesc="核心生物住所升级。\n允许招募并将元素教徒升级为元素塑造者。\n(基础增长：8/周)"

[Building.A_conflux_StarsilverFoundry H7TownGrowthEnhancer]
mName="元素集会"
mDesc="核心生物住所升级。\n每周+4元素教徒或元素塑造者。"

[Building.A_conflux_SchoolOfMagic H7TownDwelling]
mName="水之祭坛"
mDesc="精英生物住所。\n允许招募水元素，每周增长率为3。"

[Building.A_conflux_UniversityOfMagic H7TownDwelling]
mName="火之祭坛"
mDesc="精英生物住所。\n允许招募火元素，每周增长率为3。"

[Building.A_conflux_MageHousings H7TownGrowthEnhancer]
mName="燃水圣殿"
mDesc="精英生物住所升级。\n每周+1火元素或水元素。"

[Building.A_conflux_AltarOfWishes H7TownDwelling]
mName="岩石祭坛"
mDesc="精英生物住所。\n允许招募土元素，每周增长率为3。"

[Building.A_conflux_PinnacleOfWishes H7TownDwelling]
mName="空气祭坛"
mDesc="精英生物住所。\n允许招募气元素，每周增长率为3。"

[Building.A_conflux_WishingWell H7TownGrowthEnhancer]
mName="浮山圣殿"
mDesc="精英生物住所升级。\n每周+1土元素或气元素。"

[Building.A_conflux_SilverPavillion H7TownDwelling]
mName="水之使馆"
mDesc="精英生物住所。\n允许你招募甘尼萨，每周增长率为2。"

[Building.A_conflux_GoldenPavillion H7TownDwelling]
mName="火之使馆"
mDesc="精英生物住所升级。\n允许招募并将甘尼萨升级为湿婆\n(基础增长：2/周)"

[Building.A_conflux_RoaringTower H7TownGrowthEnhancer]
mName="源力元素之塔"
mDesc="精英生物住所升级。\n每周+2湿婆或甘尼萨。"

[Building.A_conflux_ArcaneTower H7TownDwelling]
mName="火盆"
mDesc="冠军生物住所。\n允许招募火鸟，每周增长率为2。"

[Building.A_conflux_ArcaneVortex H7TownDwelling]
mName="永恒之火"
mDesc="冠军生物住所升级。\n允许招募并将火鸟升级为凤凰\n(基础增长：2/周)"

[Building.A_conflux_CloudColiseum H7TownDwelling]
mName="云中竞技场"
mDesc="冠军生物住所。\n允许招募棱晶龙，每周增长率为2。"

[Building.A_conflux_ThundercloudColiseum H7TownDwelling]
mName="雷云竞技场"
mDesc="冠军生物住所升级。\n允许招募并将棱晶龙升级为量子龙。\n(基础增长：2/周)"

[Building.A_conflux_Elite_extra H7TownDwelling]
mName="冲突裂隙"
mDesc="精英生物住所。\n允许招募元素炼金术士。\n可以使用\"全部招募\"功能招募\n(基础增长：4/周)"

[Building.A_conflux_extra_champion H7TownDwelling]
mName="精灵龙森林"
mDesc="冠军生物住所。\n允许招募精灵龙。\n可以使用\"全部招募\"功能招募\n(基础增长：1/周)"

[Building.A_conflux_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="为所有访问此城镇的英雄提供即时召回法术。\n使拥有此法术的英雄能够返回此城镇，如果这是最近的可用城镇。"

[Building.A_conflux_ManaCore H7TownBuilding]
mName="知识祭坛"
mDesc="英雄首次访问城堡时，获得+2 %icon_arcane_knowledge奥术知识。"

[Building.A_conflux_MarketPlace H7TownMarketplace]
mName="市场"
mDesc="提供交易资源的选项。"

[Building.A_conflux_PyramidalCraft H7TownUtilityUnitDwelling]
mName="元素棱镜"
mDesc="战争单位生产。\n提供购买元素放大器的选项。"

[Building.A_conflux_ResourceSilo H7TownSiloBuilding]
mName="资源仓库"
mDesc="每天随机提供1 %icon_Crystal龙血水晶、%icon_Dragonsteel龙钢、%icon_Shadowsteel暗影钢或%icon_Starsilver星银。"

[Building.A_conflux_ThievesGuild H7TownThiefGuild]
mName="盗贼行会"
mDesc="提供支付获取对手信息的选项。"

[Building.A_conflux_ArtifactRecycler H7ArtifactRecycler]
mName="宝物回收站"
mDesc="提供将宝物转换为资源的选项。"

[Building.A_conflux_Workshop H7TownUtilityUnitDwelling]
mName="黄金银行"
mDesc="该建筑每天供应500 %icon_gold黄金。"

[Building.A_conflux_CastingStage H7TownCastingStage]
mName="元素影响"
mDesc="在此城市控制区内的战斗中，增加对手英雄法术的30%法力消耗。"

[Building.A_conflux_ArcaneLibrary H7Inscriber]
mName="知识竞技场"
mDesc="每当友方英雄施放一个法术，他获得200 %icon_xp经验值。"

[Building.A__ArcaneLibrary_conflux_new H7TownArcaneLibrary]
mName="奥法图书馆"
mDesc="向魔法行会添加两个1阶和2阶法术以及一个3阶和4阶法术。"

[Building.A_conflux_ArcanePortal H7TownTearOfAsha]
mName="奥法传送门"
mDesc="每天提供5000 %ICON_GOLD黄金，并增加此城镇中生物50%的增长。\n所有你的英雄+100最大%ICON_MANA法力。"

[confluxbuildingabilities.A_conflux_CastingStage_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="施法舞台技能"
mTooltip=""

[confluxbuildingabilities.A_conflux_CastingStage_Buff H7BaseBuff]
mName="元素影响"
mTooltip="增加对手英雄法术的法力%icon_mana消耗+30%。"

[confluxbuildingabilities.A_conflux_CastingStage_Buff_hero_ennemi H7BaseBuff]
mName="元素影响"
mTooltip="此英雄施放的所有法术额外消耗%special%额外法力%icon_mana。"

[confluxbuildingabilities.A_conflux_knowedge_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="知识能力"
mTooltip=""

[confluxbuildingabilities.A_conflux_xp_Buff H7BaseBuff]
mName="法术经验"
mTooltip="每当英雄施放一个法术，他获得200 %icon_xp经验值。"

[confluxbuildingabilities.A_conflux_xp_Buff_hero H7BaseBuff]
mName="法术经验"
mTooltip="每当英雄施放一个法术，他获得200 %icon_xp经验值。"

[confluxbuildingabilities.A_knowedge_Buff H7BaseBuff]
mName="知识祭坛"
mTooltip=""

[confluxbuildingabilities.A_xp_spell_building_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="施法舞台技能"
mTooltip=""

[Faction.H7FactionConflux H7Faction]
mFactionName="元素"
mFactionFortName="元素要塞"
mFactionArmyName="元素军队%number"

[Building.A_conflux_alt_pool H7TownGrowthEnhancer]
mName="精神之塔"
mDesc="未使用..."

[Town.A_ConfluxTownLv1 H7Town]
mName=""

[Building.A_conflux_Spirit_1 H7TownDwelling]
mName="精神之井"
mDesc="精英生物住所升级。\n允许招募并将xxx升级为xxx。"

[Building.A_conflux_Spirit_2 H7TownDwelling]
mName="精神亭阁"
mDesc="精英生物住所。\n允许你招募xxx，每周增长率为2。"


v1.36beta

Added Fire and Air elementals as alternatives for Water and Earth elementals, respectively

v1.37

Corrected Tower descrpition to explain defender stat gains
Made many corrections and tweaks to make descriptions across castles be more consistent and correct

v1.37

[Faction.A_Lore_FactionConflux H7GeneralLoreEntry]
mName="元素"
mText="在远古时代，当埃拉西亚世界被战争和冲突撕裂时，有五个元素生物——直接由元素本身诞生——找到了世界的一个和平角落，并和谐地生活在一起。索拉里尔，火元素，是这群生物充满激情的领袖，对正义有着深切的渴望。诺克萨斯，水元素，以其在波光粼粼的水池中的深沉沉思而闻名。艾拉拉克丝，气元素，更常被称为云舞者，用她的机智和故事为群体带来轻松和欢乐。杜罗玛尔，土元素，深切关心周围的生物，经常在困难情况下帮助较小的生物。卡拉修斯，源力元素，对自由有着深切的渴望，大部分时间都在其他位面冒险。\n他们得知来自另一个位面的黑暗巫师马拉查偷走了平衡宝珠，试图摧毁它，为了他自己邪恶的目的而汲取这个位面的能量。这个宝珠对生命本身至关重要，防止世界结构瓦解为其基本元素。这五个朋友感到有必要采取行动保护世界免受法师的种族灭绝意图。在前往马拉查的黑暗塔的旅途中，他们穿越了燃烧的沙漠、风暴肆虐的海洋、令人毛骨悚然的寂静森林和漂浮的岛屿。他们使用元素力量克服障碍并击败马拉查派来对付他们的爪牙。\n尽管困难重重，五个元素还是到达了马拉查的权力中心。在那里，他们看到巫师被阴影笼罩，在他塔的顶部，努力解开宝珠的束缚。对他们的干扰感到愤怒，马拉查向他们发动了强大的魔法攻击。但是索拉里尔、诺克萨斯、艾拉拉克丝、杜罗玛尔和卡拉修斯联合了他们的力量，与巫师战斗。他们中和了他的法术，将他从埃拉西亚驱逐，并恢复了平衡宝珠。知道这件神器会吸引其他邪恶生物，五位守护者随后决定将宝珠藏在远离埃拉西亚的地方。卡拉修斯利用它的力量在诸界之间创造了一个避难所，五位守护者，正如他们现在被称为的那样，在那里建立了一个城市，称为\"元素城\"。他们伟大的团结壮举激励了来自埃拉西亚各地的元素加入他们。随着城市的发展，保护宝珠的力量也在增长，使得它再次被偷走的可能性越来越小。\n即使在他们离开后，守护者的事迹也被永久记述在埃拉西亚的歌曲和故事中。这些传说说，如果埃拉西亚的平衡再次受到干扰，这五位同伴和他们的人民将会挺身而出保卫埃拉西亚。"